Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: In general, functions in Perl that serve as wrappers for system calls ("syscalls") of the same name (like chown(2), fork(2), closedir(2), etc.) return true when they succeed and C<undef> otherwise, as is usually mentioned in the descriptions below.
es_es: En general, funciones en Perl que sirven como envoltorios para llamadas al sistema ("syscalls") del mismo nombre (como chown(2), fork(2), closedir(2), etc.) devuelven verdadero cuando tienen éxito y C<undef> en otro caso, como se menciona en las descripciones de más abajo.

source: Software Foundation; either version 1, or (at your option) any
es_es: Software Foundation; ya sea la versión 1, o (en su opinión) cualquier

source: \c[ [5] control char (example: chr(27))
es_es: \c[ [5] car. control (ejemplo: chr(27))

source: $rex = qr/my.STRING/is;
es_es: $rex = qr/mi.CADENA/is;

source: Just a personal note: I want you to know that I create nice things like this because it pleases the Author of my story.
es_es: Sólo un apunte personal: quiero que sepa que puedo crear cosas bonitas como ésta, ya que agrada al Autor de mi historia.

source: (Note that here C<$1> etc. are also set, and that this differs from Perl 4's behavior.) When there are no parentheses in the pattern, the return value is the list C<(1)> for success.
es_es: (Tenga en cuenta que aquí C<$1>, etc, también son establecidas, y que esto difiere del comportamiento de Perl 4). Cuando no hay paréntesis en el patrón, el valor de retorno es la lista C<(1)> en caso de éxito.

source: This document gives instructions for building Perl for RISC OS.
es_es: Este documento proporciona instrucciones para la construcción de Perl para sistemas operativos RISC.

source: foreach $index (0 ..
es_es: foreach $indice (0 ..

source: Moving a file between file systems now preserves the access and modification time stamps
es_es: Ahora, mover un archivo entre sistemas de archivos, conserva las fechas de acceso y modificación

source: The POSIX module (part of the standard perl distribution) implements ceil(), floor(), and other mathematical and trigonometric functions.
es_es: El módulo POSIX (parte de la distribución estándar de Perl) implementa ceil(), floor(), y otras funciones matemáticas y trigonométricas.

source: Note that simply using
es_es: Tenga en cuenta que el simple uso de

source: Has the same effect as
es_es: Tiene el mismo efecto que

source: Only the value of the last C<chop> is returned.
es_es: Sólo se devuelve el valor del último recorte.

source: my($a, $b, %rest) = @_;
es_es: my($a, $b, %resto) = @_;

source: If the variable was previously declared with C<my>, it uses that variable instead of the global one, but it's still localized to the loop.
es_es: Si la variable fue previamente declarada con C<my>, usará esta variable en vez de la global, pero sigue siendo local en el bucle.

source: eval { $answer = }; # WRONG
es_es: eval { $respuesta = }; # MAL

source: In scalar context, it comes back as a single (potentially multi-line) string, or undef if the command failed.
es_es: En contexto escalar, se devuelve como una sola cadena de caracteres (con, posiblemente, múltiples líneas dentro), o undef si el comando ha fallado.

source: But if they do not, all characters will be in either 32- or 64-bit complements, depending on your architecture.
es_es: Pero si no lo son, todos los caracteres será complemento a 32- o 64-bit, dependiendo de su arquitectura.

source: The "make test" step runs a Perl Verification Procedure, usually before installation.
es_es: El paso "make test" ejecuta un I<Perl Verification Procedure>, normalmente antes de la instalación.

source: Sets the socket option requested.
es_es: Establece la opción de socket solicitada.

source: perlrecharclass Perl regular expression character classes
es_es: perlrecharclass Clases de caracteres en expresiones regulares

source: For more sophisticated test suites there are Test::More and Test::MockObject.
es_es: Para obtener más bancos de pruebas sofisticadas use Test::More y Test::MockObject.

source: $sentences++;
es_es: $sentencias++;

source: This is due to Haiku not implementing C</dev/log> support yet.
es_es: Esto se debe a que Haiku aún no implementa soporte para C</dev/log>.

# print " " x ($tab/8), ' ' x ($tab%8); # tab over
source: print "\t" x ($tab/8), ' ' x ($tab%8); # tab over
es_es: print "\t" x ($tab/8), ' ' x ($tab%8); # relleno con tabuladores

source: right
es_es: bien

source: The first version, the one without the indirect object, ran the I<echo> program, passing it C<"surprise"> an argument.
es_es: La primera versión, sin el objeto indirecto, ejecuta el programa I<echo>, pasándole C<"sorpresa"> como argumento.

source: Since Perl 5.7.2, if the first two elements of the list are C<undef>, the utime(2) syscall from your C library is called with a null second argument.
es_es: Desde Perl 5.7.2, si los dos primeros elementos de la lista son C<undef>, se llama a la biblioteca del sistema C utime(2) con un segundo argumento nulo.

source: Calls the System V IPC function msgget(2).
es_es: Llama a la función System V IPC msgget(2).

source: On the other hand
es_es: De otra forma

source: A BLOCK by itself (labeled or not) is semantically equivalent to a loop that executes once.
es_es: Un BLOQUE por sí mismo (etiquetado o no) es semánticamente equivalente a un bucle que se ejecuta una vez.

source: Then again, you could always use parentheses.
es_es: Por otra parte, siempre se puede utilizar paréntesis.

source: Arbitrary URL schemes now allowed
es_es: Ahora se permiten nuevos esquemas URL arbitrarios

source: Perl's C-style C<for> loop works like the corresponding C<while> loop; that means that this:
es_es: El estilo de los bucles C<for> del C funcionan igual que el correspondiente bucle C<while>. Es decir:

source: V An unsigned long (32-bit) in "VAX" (little-endian) order.
es_es: V Un largo sin signo (32 bit) en orden "VAX" (little-endian).

source: This means that packed floating-point data written on one machine may not be readable on another, even if both use IEEE floating-point arithmetic (because the endianness of the memory representation is not part of the IEEE spec).
es_es: Esto significa que datos empaquetados de punto flotante escritos en una máquina quizás no puedan ser leídos en otra, aunque ambas utilizan aritmética IEEE de punto flotante (porque la ordenación de bytes de la representación en memoria no es parte de la especificación IEEE).

source: See also L<perlipc/"SysV IPC">, C<IPC::SysV>, C<IPC::Semaphore> documentation.
es_es: Vea también la documentación de L<perlipc/"SysV IPC">, C<IPC::SysV>, y C<IPC::Semaphore>.

source: The F<perldoc> program gives you access to all the documentation that comes with Perl.
es_es: El programa F<perldoc> proporciona acceso a toda la documentación incluida en Perl.

source: perlartistic Perl Artistic License
es_es: perlartistic Licencia Artistic de Perl

source: if (/foo/) { ... } # true if $_ contains "foo"
es_es: if (/foo/) { ... } # verdadero si $_ contiene "foo"

source: =head2 Special Topics
es_es: =head2 Temas especiales

source: To do what you meant properly, you must write:
es_es: Para hacer correctamente lo que quería decir, debe escribir:

source: my ($realfilename,$result);
es_es: my ($realnombrearchivo,$resultado);

source: It is intended to mark placeholder code, that is not yet implemented.
es_es: Su objetivo es marcar una posición de código, que aún no está implementado.

source: 5.8.3 23:59:59 GMT, Wednesday December 31st 2003
es_es: 5.8.3 23:59:59 GMT miércoles, 31 de diciembre 2003

source: my $x; my $x; # warns
es_es: my $x; my $x; # avisa

source: This section describes the notion of better/worse for combining operators.
es_es: Esta sección describe el concepto de mejor/peor para los operadores de combinación.

source: =item accept NEWSOCKET,GENERICSOCKET X<accept>
es_es: =item accept NUEVOSOCKET,SOCKETGENÉRICO X<accept>

source: Try to document your code and use Pod formatting in a consistent way.
es_es: Intente documentar su código y usar formateo Pod de una forma consistente.

source: If OFFSET is past the end of the array, Perl issues a warning, and splices at the end of the array.
es_es: Si el DESPLAZAMIENTO es más allá del final del array, Perl lanza una advertencia, y extrae al final del array.

source: (C<and>, C<or> and C<not> aren't just in the above table as descriptions of the operators.
es_es: (En la tabla anterior C<and>, C<or> y C<not> no son solo descripciones de los operadores.

source: Your module should have a clearly defined scope which is no longer than a single sentence.
es_es: Su módulo debe tener un ámbito claramente definido que no es más que una sola instrucción.

source: If the SEARCHLIST is delimited by bracketing quotes, the REPLACEMENTLIST has its own pair of quotes, which may or may not be bracketing quotes; for example, C<tr[aeiouy][yuoiea]> or C<tr(+\-*/)/ABCD/>.
es_es: Si la LISTA_BÚSQUEDA está delimitada por sus propios delimitadores, la LISTA_REEMPLAZO tiene su propio par de delimitadores, que pueden o no ser los mismos delimitadores que los primeros. Por ejemplo, C<tr[aeiouy][yuoiea]> o C<tr(+\-*/)/ABCD/>.

source: $_ = "dlrow ,olleH";
es_es: $_ = "odnum ,aloH";

source: See L<perlop/"Quote and Quote-like Operators"> for a list.
es_es: Vea L<perlop/"Comillas y Operadores de comillas"> para una lista de ellos.

source: Likewise, C<$AoA[2]> is not an array, but an array ref.
es_es: Del mismo modo, C<$AoA[2]> no es un array, si no una referencia a un array.

source: Good example:
es_es: Buen ejemplo:

source: {3,} matches 3 or more of the previous thing
es_es: {3,} detecta 3 o más coincidencias de lo anterior

source: (Although on older perls, which don't have support for lexical pragmas, it keeps its global behaviour.) (Audrey Tang)
es_es: (Aunque en versiones anteriores de perl, que no cuentan con el apoyo de pragmas léxicos, mantiene su comportamiento global.) (Audrey Tang)

source: C<XS::Typemap> upgraded to version 0.02
es_es: C<XS::Typemap> actualizado a la versión 0.02

source: -u File has setuid bit set.
es_es: -u Archivo tiene puesto el bit setuid.

source: Perl remains fundamentally a dynamically typed language, not a statically typed one.
es_es: En esencia, Perl es un lenguaje de tipos dinámicos, no de tipos estáticos.

source: If you actually want the key to be stored in the DBM database as a C int, you will have to use C<pack> when writing, and C<unpack> when reading.
es_es: Si desea almacenarla como un entero de C, debe usar C<pack> al escribir y C<unpack> al leer.

source: Here are the statistics for Perl 5.005_62 on my system:
es_es: Estas son las estadísticas correspondientes a Perl 5.005_62 en mi sistema:

source: C<PerlIO::scalar> understands C<< $/ = "" >> now
es_es: C<PerlIO::scalar> ahora entiende C<< $/ = "" >>

source: This would be a problem with autovivified filehandles, but it may be dynamically set to the format of your choice by assigning the name to the C<$^> variable while that filehandle is selected.
es_es: Esto podría ser un problema con identificadores de archivo autovivificados, pero puede ser configurado de forma dinámico con el formato de su elección mediante la asignación del nombre a la variable C<$^> mientras esté seleccionado el identificador de archivo.

source: That said, there will always be small, focused, special-purpose languages dedicated to a specific problem domain that are simply more convenient for certain kinds of problems.
es_es: Sin embargo, siempre habrá lenguajes reducidos de propósito específico orientados a un dominio de un problema concreto, más cómodos para afrontar determinados tipos de problemas.

source: Documentation tweaks and typo fixes
es_es: Ajustes y correcciones de errata en la documentación

source: A word boundary (C<\b>) is a spot between two characters that has a C<\w> on one side of it and a C<\W> on the other side of it (in either order), counting the imaginary characters off the beginning and end of the string as matching a C<\W>.
es_es: Un límite de palabra (C<\b>) es un punto que hay entre dos caracteres que tienen un C<\w> a un lado y un C<\W> al otro lado de él (en cualquier orden), contando con los caracteres imaginarios del principio y final de la cadena coincidentes con un C<\W>.

source: printf '<%#B>', 12; # prints "<0B1100>"
es_es: printf '<%#B>', 12; # imprime "<0B1100>"

source: Preserve the string matched such that ${^PREMATCH}, ${^MATCH}, and ${^POSTMATCH} are available for use after matching.
es_es: Preserva la cadena coincidente, de tal manero que ${^PREMATCH}, ${^MATCH} y ${^POSTMATCH} están disponibles para su uso después de la comprobación.

source: =head1 Here There Be Pods!
es_es: =head1 ¡Aquí estarán los Pods!

# or die "Can't open: $! ";
source: or die "Can't open: $!\n";
es_es: or die "No puedo abrir: $!\n";

source: Perl Mongers?
es_es: ¿Y Perl Mongers?

source: The C style for loop is rarely needed in Perl since Perl provides the more friendly list scanning C<foreach> loop.
es_es: El bucle for de C no se suele usar, ya que Perl proporciona una alternativa más sencilla para recorrer listas, el bucle C<foreach>.

source: This is portable only when all platforms sharing packed data use the same binary representation for signed integers; for example, when all platforms use two's-complement representation.
es_es: Esto es portátil solo cuando todas las plataformas compartiendo datos empaquetados usa la misma representación binaria de enteros con signo; por ejemplo, cuando todas las plataformas utilizan la representación de complemento a dos.

source: =head2 Release considerations
es_es: =head2 Consideraciones del lanzamiento

source: warn "Neither POD nor CODE!?"
es_es: warn "Ni POD ni CÓDIGO!?"

source: Put the opening parentheses before the operator to separate it from code that follows (this applies only to operators with higher precedence than unary operators, of course):
es_es: Poner el paréntesis de apertura antes del operador para separarlo del código que le sigue (esto se aplica únicamente a los operadores con mayor precedencia que los operadores unarios, por supuesto):

source: (The difference is largely because Perl 5 does not, even internally, have a boolean type.)
es_es: (La diferencia es incluso mayor, porque Perl 5 no tiene, incluso internamente, un tipo booleano)

source: This is a "postponed" regular subexpression.
es_es: Esta es una subexpresión regular "pospuesta".

source: At The Second O'Reilly Open Source Software Convention, Larry Wall announced Perl 6 development would begin in earnest.
es_es: En la Segunda Convención de Software Open Source de O'Reilly, Larry Wall anunció que el desarrollo de Perl 6 iba a empezar en serio.

source: by Steve Lidie and Nancy Walsh
es_es: Steve Lidie y Nancy Walsh

source: eval { $answer = $a / $b; }; warn $@ if $@;
es_es: eval { $respuesta = $a / $b; }; warn $@ if $@;

source: =head2 C<perlivp> enhancements
es_es: =head2 Mejoras en C<perlivp>

source: For various reasons, Perl is probably not well-suited for real-time embedded systems, low-level operating systems development work like device drivers or context-switching code, complex multi-threaded shared-memory applications, or extremely large applications.
es_es: Por diversos motivos, es probable que Perl no sea adecuado para sistemas incrustados en tiempo real, trabajo de desarrollo de sistemas operativos a bajo nivel, como controladores de dispositivos o código de cambio de contexto de subprocesos, aplicaciones complejas de memoria compartida y múltiples subprocesos, o aplicaciones extremadamente grandes.

source: CLASSNAME is the name of a class implementing objects of correct type.
es_es: CLASE es el nombre de la clase que implementa objetos del tipo correcto.

source: Yes.
es_es: Sí.

source: unless ($return = do $file) { warn "couldn't parse $file: $@" if $@; warn "couldn't do $file: $!" unless defined $return; warn "couldn't run $file" unless $return;
es_es: unless ($return = do $file) { warn "no puedo analizar $file: $@" if $@; warn "no puedo hacer $file: $!" unless defined $return; warn "no puedo ejecutar $file" unless $return;

source: =head3 Metacharacters
es_es: =head3 Metacaracteres

source: Once it is reached, matching continues in B, which may also backtrack as necessary; however, should B not match, then no further backtracking will take place, and the pattern will fail outright at the current starting position.
es_es: Una vez que se alcanza, la coincidencia continúa en B, que también puede hacer una vuelta atrás cuando sea necesario; sin embargo, si no hubiera coincidencia con B, entonces ya no se llevará a cabo la vuelta atrás, y el patrón fallará de forma absoluta en la actual posición de inicio.

source: =head2 Unsafe signals again available
es_es: =head2 Acceso a señales de forma insegura de nuevo disponibles

source: To help you convert legacy programs to Perl, we've included three conversion filters:
es_es: Los tres filtros de conversión siguientes generan código Perl:

source: There are a handful of remaining test failures on VMS, mostly due to test fixes and minor module tweaks with too many dependencies to integrate into this release from the development stream, where they have all been corrected.
es_es: Hay un puñado de pruebas fallidas que quedan en VMS, sobre todo debido a la corrección de pruebas y ajustes menores con demasiadas dependencias como para poder integrarse en esta versión de la secuencia de desarrollo, donde todos ellas han sido corregidas.

source: =head2 For Loops X<for> X<foreach>
es_es: =head2 Bucles for X<for> X<foreach>

source: =item C<''>, C<q//>, C<tr'''>, C<y'''>, the replacement of C<s'''>
es_es: =item C<''>, C<q//>, C<tr'''>, C<y'''>, y el reemplazo de C<s'''>

source: =head1 Changes
es_es: =head1 Cambios

source: perlfaq1 - General Questions About Perl
es_es: perlfaq1 - Preguntas generales sobre Perl

source: This behavior may disappear in future versions of Perl.
es_es: Este comportamiento puede desaparecer en futuras versiones de Perl.

source: The L<perlglossary> manpage is a glossary of terms used in the Perl documentation, technical and otherwise, kindly provided by O'Reilly Media, Inc.
es_es: La página de manual L<perlglossary> es un glosario de términos utilizados en la documentación de Perl, técnicos y otros, amablemente proporcionado por O'Reilly Media, Inc.

source: =head2 Testing
es_es: =head2 Pruebas

source: IBM z/OS and other EBCDIC platforms continue to be problematic regarding Unicode support.
es_es: IBM z/OS y otras plataformas EBCDIC siguen siendo problemáticas en relación con la compatibilidad con Unicode.

source: perlsource - A guide to the Perl source tree
es_es: perlsource - Guía del árbol de código fuente de Perl

source: If the operand is an identifier, a string consisting of a minus sign concatenated with the identifier is returned.
es_es: Si el operando es un identificador, es devuelta un string formado por un signo menos concatenado con el identificador.

source: Math::Fraction big, unlimited fractions like 9973 / 12967
es_es: Math::Fraction grandes e ilimitadas fracciones, como 9973 / 12967

source: Although these are grouped by family, they all have the precedence of assignment.
es_es: Aunque estos están agrupados por familia, todos ellos tienen la precedencia de la asignación.

source: is the string C<"\0X\0\0YZ">.
es_es: es la cadena C<"\0X\0\0YZ">.

source: This makes it easy to get a month name from a list:
es_es: Esto hace que sea fácil obtener un nombre de mes desde una lista:

source: You can also call C<die> with a reference argument, and if this is trapped within an C<eval>, C<$@> contains that reference.
es_es: También puede llamar a C<die> con una referencia como argumento, y si éste queda atrapado en un C<eval>, C<$@> contiene esa referencia.

source: Considering that, as of 2006, there are over ten thousand existing modules in the archive, one probably exists to do nearly anything you can think of.
es_es: En 2006 ya había más de diez mil módulos en el repositorio, por lo que no es de extrañar que pueda encontrar módulos para casi cualquier tarea.

source: Formats likely to be of most use are integer-packing ones like C<n> for Java strings, C<w> for ASN.1 or SNMP, and C<N> for Sun XDR.
es_es: Formatos de mayor uso son los empaquetados de enteros como C<n> para las cadenas de Java, C<w> de ASN.1 o SNMP, y C<N> de XDR de Sun

source: Smart matching is described in L<perlsyn/"Smart matching in detail">.
es_es: Coincidencia inteligente se describe en L<perlsyn/"Coincidencia inteligente en detalle">.

source: For example, if you have used the Data::Dumper module to dump data into different files, and then compared the files to see whether the data has changed, now you will have false positives since the order in which hashes are dumped will vary.
es_es: Por ejemplo, si ha utilizado el módulo Data::Dumper para volcar los datos en diferentes archivos, y luego comparó los archivos para ver si los datos han cambiado, ahora tendrá falsos positivos ya que el orden en que los hashes se vuelcan pueden variar.

source: See also C<each>, C<values>, and C<sort>.
es_es: Vea también C<each>, C<values> y C<sort>.

source: C<unpack()> now defaults to unpacking the C<$_>.
es_es: C<unpack()> ahora, por defecto, desempaqueta C<$_>.

source: Thus the second C<\> in C<qq/\c\/> is interpreted as a part of C<\/>, and the following C</> is not recognized as a delimiter.
es_es: Así, el segundo C<\> en C<qq/\c\/> es interpretado como una parte de C<\/>, y el siguiente C</> no es reconocido como un delimitador.

source: Tests for basic issues of how Perl parses and compiles itself.
es_es: Pruebas de problemas básicos relacionados con la manera en que Perl se analiza y compila.

source: For historical reasons, some values work on almost every system supported by Perl: 0 means read-only, 1 means write-only, and 2 means read/write.
es_es: Por razones históricas, algunos valores funcionan en casi todos los sistemas soportados por Perl: 0 significa solo lectura, 1 significa sólo escritura y 2 significa lectura y escritura.

source: Thus you can use any of the loop control statements in it to leave or restart the block.
es_es: Así que puede usar cualquiera de las instrucciones de control de bucle dentro de él para salir o reiniciarlo.

source: perlpod Perl plain old documentation
es_es: perlpod Documentación en texto simple (POD)

source: As a side-effect of this, the overloaded-ness of constants now propagates into eval("").
es_es: Como un efecto secundario de esto, la sobrecarga de las constantes ahora se propaga en eval("").

source: s/foo/bar/ le 5; # "le" infix operator
es_es: s/foo/bar/ le 5; # "le" operador infijo

source: form that you can possibly imagine, not even excepting
es_es: forma que pueda posiblemente imaginar, incluyendo

source: You can think of C<ref> as a C<typeof> operator.
es_es: Puede pensar en C<ref> como un operador C<typeof>.

source: Additionally the R may be followed by a number, (which will be true when evaluated when recursing inside of the appropriate group), or by C<&NAME>, in which case it will be true only when evaluated during recursion in the named group.
es_es: Además, el R puede ser seguido de un número (que será cierto cuando es evaluado cuando se procesa recursivamente dentro del grupo correspondiente), o por C<&NOMBRE>, en cuyo caso sólo será verdadera cuando sea evaluada durante la recursión en el grupo con nombre.

source: The key distinction between systems that need C<binmode> and those that don't is their text file formats.
es_es: La distinción clave entre los sistemas que requieren C<binmode> y los que no, es en sus formatos de archivo de texto.

# printf "%4d %s ", $hash{$key}, $key;
source: printf "%4d %s\n", $hash{$key}, $key;
es_es: printf "%4d %s\n", $hash{$clave}, $clave;
